package overloading;

public class Test {

    public static void main(String[] args) {

        MyMethods m = new MyMethods();     // لإستدعاء الدوال منه MyMethods هنا قمنا بإنشاء كائن من الكلاس

        m.sum(1000, 4000 , 500);      // int هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(10f, 40f);        // float هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(10d, 40d);        // double هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم

        System.out.println();

        m.sum(2000, -100);      // int هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(5.5, -3.3);       // لأن الأرقام تحتوي على فاصلة double هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(5.5d, -3.3d);     // double هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(5.5f, -3.3f);     // بعد كل رقم f لأننا وضعنا float هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم

        System.out.println();

        m.sum(6, 5.25);         // يقبل كلا النوعين double لأن النوع double هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(6, 5.25f);        // يقبل كلا النوعين float لأن النوع float هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم
        m.sum(6, 5.25d);        // يقبل كلا النوعين double لأن النوع double هنا سيتم إستدعاء الدالة التي تأخذ 2 باراميتر نوعهم

    }

}
